# parameters
nc: 7  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2  320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4  160 步长为2的卷积层  用来下采样  1的是功能层参数主要起到学习特征的作用是瓶颈层  通过增加或者减少瓶颈层的深度可以使模型达到
   [-1, 3, GhostBottleneck, [128,3,1]],
   [-1, 1, GhostBottleneck, [256, 3, 2]],  # 3-P3/8  80
   [-1, 9, GhostBottleneck, [256,3,1]],
   [-1, 1, SELayer, [256, 4]],
   [-1, 1, GhostBottleneck, [512, 3, 2]],  # 5-P4/16  40
   [-1, 9, GhostBottleneck, [512,3,1]],
   [-1, 1, SELayer, [512, 4]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32  20
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 1, SELayer, [1024, 4]],
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
